---
kind: method
id: M:Autodesk.Revit.DB.Macros.IEntryPoint.FinishInitialization
source: html/f4a8f6ee-0751-546e-5a87-302b9d1ac636.htm
---
# Autodesk.Revit.DB.Macros.IEntryPoint.FinishInitialization Method

## Syntax (C#)
```csharp
void FinishInitialization()
```